package 工作后刷题.zjlab电脑刷题内容.分类刷题合集.前后缀分解;

/**
 * @Author: ZBL
 * @Date: 2024-02-01  19:38
 *  统计回文子序列数目(hard)
 * 给你数字字符串 s ，请你返回 s 中长度为 5 的 回文子序列 数目。由于答案可能很大，请你将答案对 109 + 7 取余 后返回。
 *
 * 提示：
 *
 * 如果一个字符串从前往后和从后往前读相同，那么它是 回文字符串 。
 * 子序列是一个字符串中删除若干个字符后，不改变字符顺序，剩余字符构成的字符串。
 *
 *
 * 示例 1：
 *
 * 输入：s = "103301"
 * 输出：2
 * 解释：
 * 总共有 6 长度为 5 的子序列："10330" ，"10331" ，"10301" ，"10301" ，"13301" ，"03301" 。
 * 它们中有两个（都是 "10301"）是回文的。
 * 示例 2：
 *
 * 输入：s = "0000000"
 * 输出：21
 * 解释：所有 21 个长度为 5 的子序列都是 "00000" ，都是回文的。
 * 示例 3：
 *
 * 输入：s = "9999900000"
 * 输出：2
 * 解释：仅有的两个回文子序列是 "99999" 和 "00000" 。
 *
 *
 * 提示：
 *
 * 1 <= s.length <= 104
 * s 只包含数字字符。
 */
public class Code2484 {

    public int countPalindromes(String s) {
        return 0;
    }
}
