package 左神算法.进阶班二.第五章;

/**
 * @author zbl
 * @version 1.0
 * @content:某游戏是一个卡牌类游戏，玩家通过战斗或抽牌可以拿到一些
技能牌，每张技能牌都有对应的伤害值(伤 害值>=0)，当你有
了组合技属性之后，你可以在自己手头上选择任意张技能牌，
以组合技的方式来攻击 boss，组合技的总伤害将等于所组合的
各张技能牌的伤害值的乘积(只有一张牌时，组合技伤害值等于
这张牌 本身的伤害值)，但是能发动组合技必须有个前提:所有
被选择的技能牌的伤害系数之和必须等于m(m>0) 以解开封印;
你为了能赢得最终胜利，需要在所有技能牌中挑出若干张技能
牌触发组合技(每张牌只能用一 次)，以形成最大威力的组合技
攻击效果。 例如:你有伤害值分别为1,2,3,4,5的五张牌，给定
的解开封印的阈值(m)为10，那形成最大组合攻击效果 的组合
为30(5*3*2)，而不是24(4*3*2*1)，也不是20(5*4*1)，需要输
出的结果即30。
 * @date 2020/2/24 16:03
 */
public class Code_02_Max_Damage {
}
